---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.RebarSystemSpanhookRightDirn1
source: html/8c85eeb9-dd89-5422-57fd-37d67272c978.htm
---
# Autodesk.Revit.DB.ParameterTypeId.RebarSystemSpanhookRightDirn1 Property

"Hook Angle Right"

## Syntax (C#)
```csharp
public static ForgeTypeId RebarSystemSpanhookRightDirn1 { get; }
```